namespace CLessonsDA.Lesson8;

public class Lesson8HomeWork
{
    public static void Task1()
    {
        // Представьте, что вы реализуете программу для банка, которая помогает определить, погасил ли клиент
        // кредит или нет. Допустим, ежемесячная сумма платежа должна составлять 100 грн. Клиент должен
        // выполнить 7 платежей, но может платить реже большими суммами. Т.е., может двумя платежами по
        // 300 и 400 грн. Закрыть весь долг.
        // Создайте метод, который будет в качестве аргумента принимать сумму платежа, введенную
        // экономистом банка. Метод выводит на экран информацию о состоянии кредита (сумма задолженности,
        // сумма переплаты, сообщение об отсутствии долга).

        Console.WriteLine("Сумма вашего кредита 700 грн");
    }

    public static void Task2()
    {
        // Имеется N клиентов, которым компания производитель должна доставить товар. Сколько существует
        // возможных маршрутов доставки товара, с учетом того, что товар будет доставлять одна машина?
        // Напишите программу, которая будет рассчитывать и выводить на экран количество возможных
        // вариантов доставки товара. Для решения задачи, используйте факториал N!, рассчитываемый с
        // помощью рекурсии. Объясните, почему не рекомендуется использовать рекурсию для расчета
        // факториала. Укажите слабые места данного подхода.
        
        
    }

    public static void Task3()
    {
        // Напишите программу, в который пользователь в textBox1 и textBox2 вводит данные и выбирает при
        // помощи нескольких radioButton тип операции которую требуется выполнить: остаток от деления,
        // возведение в степень, конкатенация, деление. Результат выводится в textBox3 при нажатии на кнопку
        // «Вычислить»
        
        
    }
}