namespace CLessonsDA.Lesson7
{
    internal class Lesson7HomeWork
    {
        public static void Task1()
        {
            // Создайте четыре метода для выполнения арифметических операций, с именами:
            // Add - сложение, Sub - вычитание, Mul - умножение, Div - деление.
            // Каждый метод должен принимать два целочисленных аргумента и выводить на экран результат арифметической операции
            // соответствующей имени метода. Метод деления Div, должен выполнять попытку деления на ноль.
            // Требуется предоставить пользователю возможность вводить с клавиатуры значения операндов и знак арифметической операции,
            // для выполнения вычисления.


        }

        public static void Task2()
        {
            // Напишите программу, которая будет выполнять конвертирование валют.
            // Пользователь вводит:
            // сумму денег в определенной валюте,
            // курс для конвертации в другую валюту,
            // Организуйте вывод результата операции конвертирования валюты на экран.


        }

        public static void Task3()
        {
            // Напишите метод, который будет определять:
            // 1) является ли число положительным или отрицательным
            // 2) является ли оно простым (используйте технику перебора чисел)
            // Простое число - это натуральное число, которое делится на 1 и само на себя. Чтобы определить простое ли число следует найти все его целые делители.
            // Если делителей больше двух, значит оно не простое
            // 3) Делится ли на 2, 5, 3, 6, 9 без остатка


        }
    }
}
